Examinator/src/InformationRegisters/НастройкиТемФорумаСУО/НастройкиТемФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемФорумаСУО</name>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПН/ДанныеВебКабинетаСУО_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/ТемыСообщенийСУО/ТемыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТемыСообщенийСУО</name>
  <attributes>
    <name>Кому</name>
    <type>
      <types>EnumRef.АдресатыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.ОрганизаторыСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключенныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/НастройкиТемФорумаСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ЗаписатьНастройки(Тема, ИмяРеквизита = Неопределено, Значение = Неопределено, Пользователь = Неопределено, ТекущаяДата = Неопределено, НеОбновлятьДанныеВебКабинета = Ложь) Экспорт		
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ДанныеТемы   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Кому, Контекст");
	
	Если ТекущаяДата = Неопределено Тогда
		ТекущаяДата  = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Записываем настройки темы форума
	
	НаборЗаписей = РегистрыСведений.НастройкиТемФорумаСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Тема.Установить(Тема);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);

	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		// Запоминаем данные пользователя о теме форума
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Пользователь = Пользователь;
		Запись.Тема = Тема;
		Запись.РазделФорума = ДанныеТемы.Контекст;
		
	Иначе
		
		Запись = НаборЗаписей[0];
		
	КонецЕсли;
	
	Если ИмяРеквизита <> Неопределено Тогда
		
		Если Значение = Неопределено Тогда
			Запись[ИмяРеквизита] = НЕ Запись[ИмяРеквизита];
		Иначе
		    Запись[ИмяРеквизита] = Значение;
		КонецЕсли;
		
	КонецЕсли;

	Запись.ДатаПросмотра = ТекущаяДата;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбновитьДанныеВебКабинета(Отбор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отбор.Найти("Пользователь") = Неопределено Тогда
		Пользователь = Неопределено;
	Иначе
		Пользователь = Отбор.Пользователь.Значение;
	КонецЕсли;
	
	Если Отбор.Найти("Тема") = Неопределено Тогда
		Тема = Неопределено;
	Иначе
		Тема = Отбор.Тема.Значение;
	КонецЕсли;
	
	ОбновитьДанныеВебКабинетаЗаписи(Пользователь, Тема);	
	
КонецПроцедуры

Процедура ОбновитьДанныеВебКабинетаЗаписи(Пользователь, Тема) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиТемФорумаСУО.СоздатьНаборЗаписей();
	
	Если ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(Тема) Тогда
		
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		НаборЗаписей.Отбор.Тема.Установить(Тема);
		
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Для каждого Запись Из НаборЗаписей Цикл
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(Тема, Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщенияОписание, Запись.Пользователь);
		
		ПользовательскоеОписаниеJSON = Справочники.ТемыСообщенийСУО.ТемаФорумаОписаниеПользовательскоеJSON(Запись.Тема, Запись.Пользователь);
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Запись.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщенияОписание, Запись.Тема, ПользовательскоеОписаниеJSON, Перечисления.ФорматыВебДанныхСУ.json);
			
		ДанныеОТеме = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Тема, "Контекст, Кому");
		
		ЭтоГрупповоеОбсуждение = Документы.СообщениеСУО.ЭтоГрупповоеОбсуждение(ДанныеОТеме.Кому);
		
		Если ЭтоГрупповоеОбсуждение Тогда
			
			ПользовательскоеОписаниеJSON = Справочники.РазделыФорумаСУО.РазделОписаниеПользовательскоеJSON(ДанныеОТеме.Контекст, Запись.Пользователь);
			РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(Запись.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.РазделФорумаОписание, ДанныеОТеме.Контекст, ПользовательскоеОписаниеJSON, Перечисления.ФорматыВебДанныхСУ.json);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры


#КонецЕсли
